insert into categories (cat_name)
values ('Телефоны'), ('Бытовая техника');

insert into categories (cat_name, parent_cat_id)
values ('Сотовые телефоны', 1), ('Гарнитура', 1), ('Радиотелефоны', 1),
       ('Холодильники', 2), ('Пылесосы', 2);



insert into characteristics (ch_name, ch_type)
values ('Производитель','en'), ('Тип','en'), ('Платформа','en'), ('Диагональ экрана, дюймы','ran'), ('Объём встроенной памяти, Мб','ran'),
('Время работы в режиме разговора, ч','ran'), ('Время работы в режиме ожидания, ч','ran'), 
('Дальность действия, м','ran'), ('Автоответчик','en'), ('Громкая связь','en'), ('АОН','en'),
('Количество камер','en'), ('Объём морозильной камеры, л','ran'), ('Объём холодильной камеры, л','ran'),
('Тип уборки','en'), ('Источник питания','en'), ('Мощность всасывания, л','ran'), ('Тип пылесборника ','en'),('Вес, кг','ran');



insert into categories_characteristics (cat_id, ch_id)
values (3,1), (3,3), (3,4),(3,5),(3,6),(3,7),
       (4,1),(4,2),(4,6),(4,7),
       (5,1),(5,8),(5,9),(5,10),(5,11),
       (6,1),(6,2),(6,12),(6,13),(6,14),(6,19),
       (7,1),(7,2),(7,15),(7,16),(7,17),(7,18),(7,19);



insert into commodities (com_name, cat_id, price_p, price_r)
values ('HTC Desire S', 3, 11200, 12520),
       ('HTC Sensation', 3, 15000, 16835), 
       ('Samsung Galaxy Ace S5830', 3, 7650, 8760), 
       ('HTC Wildfire S', 3, 6540, 7650), 
       ('Samsung Galaxy S II i9100', 3, 15519, 21800),
       ('Samsung Galaxy Note N7000', 3, 13000, 25500),
       ('HTC One X', 3, 25490, 28490),
       ('Samsung Galaxy Nexus I9250', 3, 18000, 21950),
       ('HTC Incredible S', 3, 11000, 13990),
       ('Samsung Galaxy S Plus I9001', 3, 12000, 14540),
       ('HTC Sensation XL', 3, 19000,20000),
       ('HTC Sensation XE', 3, 16000,19000),
       ('HTC One V', 3, 10000,13990),
       ('HTC Explorer', 3, 4950, 5950),
       ('HTC Rhyme', 3, 12000,15000),
       
       ('Jabra STONE2', 4, 2108, 3581), 
       ('Plantronics Discovery 975', 4, 2130, 2590), 
       ('Jabra Extreme', 4, 2390, 2790), 
       ('Plantronics BackBeat 903+', 4, 1980, 2590), 
       ('Jabra Clipper', 4, 1109, 1620),
       
       ('Panasonic KX-TG6611', 5, 1100, 1534), 
       ('Gigaset C590', 5, 906, 1800), 
       ('Philips CD 1801', 5, 670, 900), 
       ('Shivaki SD-D2001', 5, 239, 669), 
       ('Sagem D27T', 5, 780, 1028),
       
       ('Samsung RL-34 EGRS', 6, 15798, 17550), 
       ('Bosch KGV36Z35', 6, 12800, 16300), 
       ('Bosch KGV36Z45', 6, 13900, 18190), 
       ('Indesit SFR 167', 6, 12790, 13377), 
       ('LG GA-B379 BQA', 6, 15000, 15508),
       
       ('Thomas TWIN TT Aquafilter', 7, 11000, 12700), 
       ('Samsung SD-9450', 7, 5600, 6280), 
       ('Samsung SC6530', 7, 1290, 3280), 
       ('Bosch BSG 82480', 7, 4690, 7240), 
       ('Karcher DS 5600 Mediclean', 7, 10670, 12590);



insert into commodities_characteristics (com_id, ch_id, value)
values (1, 1, 'HTC'),      (1, 3, 'Android 2.3'),  (1, 4, '3.7'),  (1, 5, '1100'),   (1, 6, '10'),  (1, 7, '455'),
       (2, 1, 'HTC'),      (2, 3, 'Android 2.3'),  (2, 4, '4.3'),  (2, 5, '1024'),   (2, 6, '8'),   (2, 7, '400'),
       (3, 1, 'Samsung'),  (3, 3, 'Android 2.2'),  (3, 4, '3.5'),  (3, 5, '158'),    (3, 6, '9'),   (3, 7, '640'),
       (4, 1, 'HTC'),      (4, 3, 'Android 2.3'),  (4, 4, '3.2'),  (4, 5, '512'),    (4, 6, '8'),   (4, 7, '410'),
       (5, 1, 'Samsung'),  (5, 3, 'Android 2.3'),  (5, 4, '4.27'), (5, 5, '16000'),  (5, 6, '18'),  (5, 7, '710'),
       (6, 1, 'Samsung'),  (6, 3, 'Android 2.3'),  (6, 4, '5.3'),  (6, 5, '16384'),  (6, 6, '10'),  (6, 7, '550'),
       (7, 1, 'HTC'),      (7, 3, 'Android 4.0'),  (7, 4, '4.7'),  (7, 5, '32768'),  (7, 6, '16'),  (7, 7, '520'),
       (8, 1, 'Samsung'),  (8, 3, 'Android 4.0'),  (8, 4, '4.65'), (8, 5, '16384'),  (8, 6, '14'),  (8, 7, '290'),
       (9, 1, 'HTC'),      (9, 3, 'Android 2.2'),  (9, 4, '4.0'),  (9, 5, '1126'),   (9, 6, '8'),   (9, 7, '370'),
       (10, 1, 'Samsung'), (10, 3, 'Android 2.3'), (10, 4, '4.0'), (10, 5, '8192'),  (10, 6, '11'), (10, 7, '750'),
       (11, 1, 'HTC'),     (11, 3, 'Android 2.3'), (11, 4, '4.7'), (11, 5, '16384'), (11, 6, '12'), (11, 7, '400'),
       (12, 1, 'HTC'),     (12, 3, 'Android 2.3'), (12, 4, '4.3'), (12, 5, '4096'),  (12, 6, '8'),  (12, 7, '310'),
       (13, 1, 'HTC'),     (13, 3, 'Android 4.0'), (13, 4, '3.7'), (13, 5, '4096'),  (13, 6, '8'),  (13, 7, '410'),
       (14, 1, 'HTC'),     (14, 3, 'Android 2.3'), (14, 4, '3.2'), (14, 5, '4096'),  (14, 6, '8'),  (14, 7, '485'),
       (15, 1, 'HTC'),     (15, 3, 'Android 2.3'), (15, 4, '3.7'), (15, 5, '4096'),  (15, 6, '10'), (15, 7, '295'),
       
       (16, 1, 'Jabra'),        (16, 2, 'Моно'),   (16, 6, '10'),   (16, 7, '360'), 
       (17, 1, 'Plantronics'),  (17, 2, 'Моно'),   (17, 6, '5'),    (17, 7, '170'), 
       (18, 1, 'Jabra'),        (18, 2, 'Моно'),   (18, 6, '5.5'),  (18, 7, '260'), 
       (19, 1, 'Plantronics'),  (19, 2, 'Стерео'), (19, 6, '7'),    (19, 7, '188'), 
       (20, 1, 'Jabra'),        (20, 2, 'Стерео'), (20, 6, '6'),    (20, 7, '192'), 
       
       (21, 1, 'Panasonic'), (21, 8, '50'), (21, 9, 'Нет'),  (21, 10, 'Есть'), (21, 11, 'Есть'),
       (22, 1, 'Gigaset'),   (22, 8, '50'), (22, 9, 'Нет'),  (22, 10, 'Есть'), (22, 11, 'Есть'),
       (23, 1, 'Philips '),  (23, 8, '40'), (23, 9, 'Нет'),  (23, 10, 'Нет'),  (23, 11, 'Есть'),
       (24, 1, 'Shivaki'),   (24, 8, '50'), (24, 9, 'Нет'),  (24, 10, 'Есть'), (24, 11, 'Нет'),
       (25, 1, 'Sagem'),     (25, 8, '50'), (25, 9, 'Есть'), (25, 10, 'Есть'), (25, 11, 'Есть'),
       
       (26, 1, 'Samsung'), (26, 2, 'Холодильник с морозильником'), (26, 19, '70'), (26, 12, '2'), (26, 13, '85'),  (26, 14, '201'),
       (27, 1, 'Bosch'),   (27, 2, 'Холодильник с морозильником'), (27, 19, '70'), (27, 12, '2'), (27, 13, '91'),  (27, 14, '223'),
       (28, 1, 'Bosch'),   (28, 2, 'Холодильник с морозильником'), (28, 19, '75'), (28, 12, '3'), (28, 13, '90'),  (28, 14, '170'),
       (29, 1, 'Indesit'), (29, 2, 'Морозильник-шкаф'),            (29, 19, '68'), (29, 12, '1'), (29, 13, '245'), (29, 14, '37'),
       (30, 1, 'LG'),      (30, 2, 'Холодильник с морозильником'), (30, 19, '70'), (30, 12, '2'), (30, 13, '86'),  (30, 14, '178'),
       
       (31, 1, 'Thomas'),  (31, 2, 'Обычный'),       (31, 19, '9.2'),  (31, 15, 'Сухая / влажная'), (31, 16, 'Сеть'),        (31, 17, '240'), (31, 18, 'Аквафильтр'),
       (32, 1, 'Samsung'), (32, 2, 'Обычный'),       (32, 19, '10.7'), (32, 15, 'Влажная'),         (32, 16, 'Сеть'),        (32, 17, '200'), (32, 18, 'Аквафильтр'),
       (33, 1, 'Samsung'), (33, 2, 'Обычный'),       (33, 19, '5.2'),  (33, 15, 'Сухая'),           (33, 16, 'Сеть'),        (33, 17, '360'), (33, 18, 'Циклонный фильтр'),
       (34, 1, 'Bork'),    (34, 2, 'Автомобильный'), (34, 19, '1.48'), (34, 15, 'Сухая'),           (34, 16, 'Аккумулятор'), (34, 17, '80'),  (34, 18, 'Циклонный фильтр'),
       (35, 1, 'Karcher'), (35, 2, 'Робот'),         (35, 19, '2'),    (35, 15, 'Сухая'),           (35, 16, 'Аккумулятор'), (35, 17, '200'), (35, 18, 'Циклонный фильтр');
       
